CREATE EXTENSION IF NOT EXISTS vector;

CREATE TABLE categories (
    id SERIAL PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    row_index SMALLINT NOT NULL,
    col_index SMALLINT NOT NULL,
    gemini_embedding VECTOR(768) NULL
);

CREATE TABLE users (
    id SERIAL PRIMARY KEY,
    email VARCHAR(100) UNIQUE NOT NULL,
    full_name VARCHAR(100)
);

CREATE TABLE user_shopping_items (
    id SERIAL PRIMARY KEY,
    user_id INTEGER REFERENCES users(id) ON DELETE CASCADE,
    item_name VARCHAR(255) NOT NULL,
    mapped_category_id INTEGER REFERENCES categories(id),
    calculated_order SMALLINT
);

CREATE INDEX ON categories
USING ivfflat (gemini_embedding vector_l2_ops)
WITH (lists = 100);

INSERT INTO categories (name, row_index, col_index) VALUES
('סבונים, אבקת כביסה, מרכך כביסה, כביסה, שמפו, מרכך, סבון גוף', 0, 0),
('גומיות שיער, מברשות, פדים, קרם שיער, קליפסים, חומרי רצפה, חומרי ניקוי, מוצרי שיער', 1, 0),
('מברשות ומשחות שיניים, קיסמים, אוזניים ושיניים, סבון כלים, מדיח כלים, כריות וסקוצ''ים לכלים', 2, 0),
('דליים, מגב לשיש, מגב רצפה, מטאטא, כף אשפה', 3, 0),
('חד פעמי, ספוג הפלא, סקוצ לסירים', 4, 0),
('חד פעמי, מפיות, כפפות, נרות, תרסיס לשירותים, תבניות אלומיניום', 5, 0),
('שקיות אשפה, שקיות אוכל, נייר כסף, נייר נצמד, שקיות קוקי', 6, 0),
('מארזי שתייה רגילה, מארזי שתייה מוגזת', 7, 0),
('סוכריות, ממתקים, מטרנה, גרברים, נשכני תינוקות, דייסה, מוצרי תינוקות, מחית פירות', 0, 1),
('שוקולדים, חלווה, מוצצים, בקבוקים לתינוקות', 1, 1),
('מוצרי אפייה, ממרחים, שוקולד, ריבות, טיטולים, מגבונים', 2, 1),
('מוצרי אפייה, אבקת אפייה, סוכר וניל, קקאו, אבקת סוכר, תמצית וניל, קוקוס, טישו, נייר טואלט, נייר סופג', 3, 1),
('שתייה מתוקה יחידים, בקבוקים גדולים', 4, 1),
('שתייה מתוקה בקבוקים קטנים, שתייה מתוקה יחידים', 5, 1),
('בקבוקי מים גדולים, בקבוקי מים קטנים, מים בטעמים, שתייה עדינה', 6, 1),
('שתייה מוגזת בקבוקים גדולים, שתייה מוגזת בקבוקים קטנים, שתייה מוגזת יחידים', 7, 1),
('שוקו, תה, קפה, אבקת אייס קפה, סוכרזית', 0, 2),
('עוגיות סנדוויץ'', עוגיות מצופות, חיוכים, חטיפי אנרגיה, ופלים, גליליות', 1, 2),
('דגני בוקר, עוגיות נוספות, חטיפי אנרגיה, עוגיות עוגי', 2, 2),
('חטיפים מלוחים, קרקרים מלוחים, ביסקוויטים', 3, 2),
('מיץ ענבים, פירות הדר, לימונים', 4, 2),
('יין, פירות הדר', 5, 2),
('בירה, פירות הדר', 6, 2),
('קצבייה, עוף טרי', 7, 2),
('אבקת פטריות, מנות חמות, אבקת מרק, שקדי מרק, תבלינים', 0, 3),
('שימורים, טונה, תירס, זיתים, פסטות, קוסקוס', 1, 3),
('פירורי לחם, קטניות, קינואה, אורז, רטבים, קטשופ, צ''ילי, מיונז, חרדל, רוטב סויה טריאקי', 2, 3),
('שמן זית, מיץ לימון, שמן, חומץ, קמח, סוכר, מלח', 3, 3),
('ירקות, מלפפון, עגבנייה', 4, 3),
('ירקות, קישוא, בטטה, תפוחי אדמה, בצל, חציל', 5, 3),
('פירות', 6, 3),
('קצבייה, בשר טרי', 7, 3),
('חלב, שתייה חלבית, גלידות, ארטיקים, ביצים', 0, 4),
('גבינות בטעמים, בצקים קפואים', 1, 4),
('מעדנים, יוגורטים, דגים', 2, 4),
('מוצרי אפייה קרה, קצפת ושמנת, עופות ובשר קפוא', 3, 4),
('גבינות מיוחדות, גבינות קשות, גבינות רכות', 4, 4),
('חמאה, מחמאה, מרגרינה, שמנת מתוקה, רביולי', 5, 4),
('פסטרמות, נקניקיות, בשר מעושן', 6, 4),
('טורטיות, לחם, לחמניות, פיתות, פריכיות', 7, 4);
